[
    {
        "id": "blue-lagoon",
        "name": "The Blue Lagoon",
        "location": "Grindavík",
        "description": "A world-renowned geothermal spa, famous for its mineral-rich, milky-blue waters set amidst a dramatic lava field.",
        "details": "The Blue Lagoon is one of Iceland's most popular attractions, offering a unique bathing experience. The water's unique composition of silica, algae, and minerals is known for its healing properties. Pre-booking is essential.",
        "image": "blue-lagoon.webp",
        "type": "Spa",
        "rating": 4.8
    },
    {
        "id": "golden-circle",
        "name": "Golden Circle",
        "location": "Southern Iceland",
        "description": "A popular tourist route covering three main natural attractions: Þingvellir National Park, the Geysir geothermal area, and the Gullfoss waterfall.",
        "details": "The Golden Circle is a classic day trip from Reykjavík, showcasing Iceland's geological wonders and historical significance. Þingvellir is a UNESCO World Heritage site, Geysir is home to the active Strokkur geyser, and Gullfoss is a majestic waterfall.",
        "image": "golden-circle.webp",
        "type": "Route",
        "rating": 4.7
    },
    {
        "id": "jokulsarlon",
        "name": "Jökulsárlón Glacier Lagoon",
        "location": "Southeast Iceland",
        "description": "A large glacial lake filled with icebergs breaking off from the Breiðamerkurjökull glacier, a part of Vatnajökull National Park.",
        "details": "This stunning lagoon offers boat tours among the floating icebergs, which vary in size and color. It's a truly mesmerizing natural spectacle, often visited alongside the nearby Diamond Beach.",
        "image": "jokulsarlon.webp",
        "type": "Glacier Lagoon",
        "rating": 4.9
    },
    {
        "id": "diamond-beach",
        "name": "Diamond Beach",
        "location": "Southeast Iceland",
        "description": "A black sand beach adjacent to Jökulsárlón Glacier Lagoon, where icebergs wash ashore and glitter like diamonds against the dark sand.",
        "details": "A photographer's paradise, Diamond Beach provides a stark and beautiful contrast between the volcanic black sand and the crystal-clear ice chunks. It's easily accessible from Jökulsárlón.",
        "image": "diamond-beach.webp",
        "type": "Beach",
        "rating": 4.8
    },
    {
        "id": "reynisfjara",
        "name": "Reynisfjara Black Sand Beach",
        "location": "South Coast",
        "description": "Famous for its black sand, basalt columns, and the Reynisdrangar sea stacks rising from the ocean.",
        "details": "Located near the village of Vík í Mýrdal, this beach is incredibly scenic but also dangerous due to strong sneaker waves. Visitors should always be cautious and respect warning signs.",
        "image": "reynisfjara.webp",
        "type": "Beach",
        "rating": 4.6
    },
    {
        "id": "skogafoss",
        "name": "Skógafoss Waterfall",
        "location": "South Coast",
        "description": "One of Iceland's largest and most beautiful waterfalls, with a 60-meter drop and often producing a single or double rainbow.",
        "details": "You can walk right up to the waterfall's base, feeling its immense power. There's also a staircase leading to an observation platform above for panoramic views of the coast.",
        "image": "skogafoss.webp",
        "type": "Waterfall",
        "rating": 4.7
    },
    {
        "id": "seljalandsfoss",
        "name": "Seljalandsfoss Waterfall",
        "location": "South Coast",
        "description": "A unique waterfall where visitors can walk behind the cascading water, offering a memorable perspective.",
        "details": "This waterfall is particularly popular for its walkable path behind the curtain of water, especially beautiful during sunset. Bring waterproof clothing!",
        "image": "seljalandsfoss.webp",
        "type": "Waterfall",
        "rating": 4.6
    },
    {
        "id": "dyrholaey",
        "name": "Dyrhólaey Arch",
        "location": "South Coast",
        "description": "A massive rock arch protruding into the sea, offering stunning coastal views and a popular spot for puffin watching.",
        "details": "Dyrhólaey is a promontory with a lighthouse and panoramic views of the black sand beaches, glaciers, and the impressive rock arch. It's a protected nature reserve.",
        "image": "dyrholaey.webp",
        "type": "Landmark",
        "rating": 4.5
    },
    {
        "id": "hallgrimskirkja",
        "name": "Hallgrímskirkja Church",
        "location": "Reykjavík",
        "description": "Reykjavík's iconic landmark church, known for its unique architecture inspired by basalt columns and a tower offering city views.",
        "details": "This impressive Lutheran parish church dominates the Reykjavík skyline. Visitors can take an elevator to the top of the tower for incredible 360-degree views of the city and surrounding mountains.",
        "image": "hallgrimskirkja.webp",
        "type": "Architecture",
        "rating": 4.5
    },
    {
        "id": "thingvellir",
        "name": "Þingvellir National Park",
        "location": "Golden Circle",
        "description": "A UNESCO World Heritage site where the North American and Eurasian tectonic plates meet and drift apart, creating a dramatic rift valley.",
        "details": "Historically significant as the site of Iceland's ancient parliament, Alþingi. It's also popular for snorkeling and diving in the crystal-clear Silfra fissure.",
        "image": "thingvellir.webp",
        "type": "National Park",
        "rating": 4.7
    },
    {
        "id": "landmannalaugar",
        "name": "Landmannalaugar",
        "location": "Highlands",
        "description": "A stunning geothermal wonderland in the Highlands, famous for its vibrant rhyolite mountains and natural hot springs.",
        "details": "Accessible primarily in summer via F-roads, Landmannalaugar is a hiker's paradise with trails ranging from easy walks to multi-day treks. The colorful mountains are a result of volcanic activity.",
        "image": "landmannalaugar.webp",
        "type": "Nature Reserve",
        "rating": 4.9
    },
    {
        "id": "askja",
        "name": "Askja Caldera",
        "location": "Highlands",
        "description": "A remote and active volcano caldera with a large, deep lake (Öskjuvatn) and a smaller, warm crater lake (Víti) suitable for bathing.",
        "details": "Reaching Askja requires a challenging drive through the Highlands, but the otherworldly landscape and the chance to bathe in Víti make it a unique adventure. The area is often compared to the moon's surface.",
        "image": "askja.webp",
        "type": "Volcano",
        "rating": 4.7
    },
    {
        "id": "vatnajokull",
        "name": "Vatnajökull National Park",
        "location": "Southeast Iceland",
        "description": "Europe's largest glacier and surrounding area, offering diverse landscapes including ice caves, volcanoes, and geothermal activity.",
        "details": "This vast national park encompasses a huge variety of natural wonders. Activities include glacier hiking, ice caving (seasonal), and exploring the various outlets of the glacier.",
        "image": "vatnajokull.webp",
        "type": "National Park",
        "rating": 4.9
    },
    {
        "id": "snæfellsnes",
        "name": "Snæfellsnes Peninsula",
        "location": "West Iceland",
        "description": "Often called 'Iceland in Miniature' due to its diverse landscapes, including a glacier, black sand beaches, and charming fishing villages.",
        "details": "This peninsula is home to Snæfellsjökull glacier, a stratovolcano, and numerous picturesque spots like Arnarstapi, Hellnar, and the iconic Kirkjufell mountain.",
        "image": "snæfellsnes.webp",
        "type": "Peninsula",
        "rating": 4.8
    },
    {
        "id": "kirkjufell",
        "name": "Kirkjufell Mountain",
        "location": "Snæfellsnes Peninsula",
        "description": "A distinctive, arrow-shaped mountain often considered one of Iceland's most photographed landmarks, especially with its nearby waterfall, Kirkjufellsfoss.",
        "details": "This mountain gained international fame from Game of Thrones. Its unique shape and the scenic waterfall in the foreground make it a popular spot for photographers.",
        "image": "kirkjufell.webp",
        "type": "Mountain",
        "rating": 4.7
    },
    {
        "id": "stokksnes",
        "name": "Stokksnes Peninsula & Vestrahorn",
        "location": "Southeast Iceland",
        "description": "A dramatic landscape featuring the iconic Vestrahorn mountain, black sand dunes, and a Viking village film set.",
        "details": "This area offers stunning views, especially at sunrise or sunset, with the jagged peaks of Vestrahorn reflecting in the calm waters. It's a less crowded alternative to some of the more famous spots.",
        "image": "stokksnes.webp",
        "type": "Peninsula",
        "rating": 4.6
    },
    {
        "id": "fjaðrárgljúfur",
        "name": "Fjaðrárgljúfur Canyon",
        "location": "South Iceland",
        "description": "A magnificent and winding canyon with steep walls, carved by glacial meltwater over thousands of years.",
        "details": "This impressive canyon offers walking paths along its edges, providing breathtaking views of the river below and the unique rock formations. It gained popularity after being featured in a Justin Bieber music video.",
        "image": "fjaðrárgljúfur.webp",
        "type": "Canyon",
        "rating": 4.5
    }
]