{
    "attractions": [
      {
        "id": 1,
        "name": "The Blue Lagoon",
        "shortDescription": "A famous geothermal spa with milky-blue waters.",
        "description": "The Blue Lagoon is a world-renowned geothermal spa located in a lava field near Grindavík. The warm, mineral-rich waters are believed to have healing properties.",
        "imageUrl": "images/blue-lagoon.webp",
        "region": "Reykjanes Peninsula",
        "type": "Geothermal Spa"
      },
      {
        "id": 2,
        "name": "Golden Circle",
        "shortDescription": "A popular tourist route with stunning natural sights.",
        "description": "The Golden Circle is a famous tourist route covering about 300 kilometers, including Þingvellir National Park, the Gullfoss waterfall, and the Geysir geothermal area.",
        "imageUrl": "images/golden-circle.webp",
        "region": "Southern Iceland",
        "type": "Tourist Route"
      },
      {
        "id": 3,
        "name": "Jökulsárlón Glacier Lagoon",
        "shortDescription": "A large glacial lake with floating icebergs.",
        "description": "Jökulsárlón is a large glacial lake on the edge of Vatnajökull National Park. It is famous for the icebergs that break off from the Breiðamerkurjökull glacier.",
        "imageUrl": "images/jokulsarlon.webp",
        "region": "Southeastern Iceland",
        "type": "Natural Wonder"
      },
      {
        "id": 4,
        "name": "Diamond Beach",
        "shortDescription": "Black sand beach with washed-up icebergs.",
        "description": "Diamond Beach is a black sand beach located next to the Jökulsárlón Glacier Lagoon. It gets its name from the large chunks of ice that wash ashore and glisten like diamonds.",
        "imageUrl": "images/diamond-beach.webp",
        "region": "Southeastern Iceland",
        "type": "Natural Wonder"
      },
      {
        "id": 5,
        "name": "Skógafoss Waterfall",
        "shortDescription": "One of Iceland's largest and most beautiful waterfalls.",
        "description": "Skógafoss is a spectacular waterfall on the Skógá River. The waterfall produces a large amount of spray, often creating single or double rainbows on sunny days.",
        "imageUrl": "images/skogafoss.webp",
        "region": "Southern Iceland",
        "type": "Waterfall"
      },
      {
        "id": 6,
        "name": "Reynisfjara Beach",
        "shortDescription": "A black sand beach with basalt columns and sea stacks.",
        "description": "Reynisfjara is a black pebble beach near the village of Vík. The beach is famous for its dramatic black sand, basalt columns, and the powerful Atlantic waves.",
        "imageUrl": "images/reynisfjara.webp",
        "region": "Southern Iceland",
        "type": "Natural Wonder"
      },
      {
        "id": 7,
        "name": "Hallgrímskirkja Church",
        "shortDescription": "An iconic Lutheran parish church in Reykjavík.",
        "description": "Hallgrímskirkja is the tallest church in Iceland and one of the country's most recognizable landmarks. Its unique design is inspired by the basalt columns found in Icelandic landscapes.",
        "imageUrl": "images/hallgrim.webp",
        "region": "Reykjavík",
        "type": "Landmark"
      },
      {
        "id": 8,
        "name": "Myvatn Nature Baths",
        "shortDescription": "A natural lagoon with mineral-rich, geothermal water.",
        "description": "Often called the 'Blue Lagoon of the North,' the Myvatn Nature Baths offer a relaxing geothermal experience with stunning views of the surrounding volcanic landscape.",
        "imageUrl": "images/askja.webp",
        "region": "Northern Iceland",
        "type": "Geothermal Spa"
      },
      {
        "id": 9,
        "name": "Gullfoss Waterfall",
        "shortDescription": "A magnificent two-tiered waterfall on the Hvítá River.",
        "description": "Gullfoss, or 'Golden Falls,' is one of Iceland's most famous waterfalls. It cascades down two distinct drops into a rugged canyon, creating a dramatic spectacle.",
        "imageUrl": "images/varnajok.webp",
        "region": "Southern Iceland",
        "type": "Waterfall"
      },
      {
        "id": 10,
        "name": "Þingvellir National Park",
        "shortDescription": "A UNESCO World Heritage site and a geological wonder.",
        "description": "Þingvellir holds historical significance as the site of Iceland's first parliament. It is also a geological marvel where the North American and Eurasian tectonic plates meet.",
        "imageUrl": "images/ping.webp",
        "region": "Southern Iceland",
        "type": "National Park"
      },
      {
        "id": 11,
        "name": "Geysir Geothermal Area",
        "shortDescription": "Home to the famous Strokkur geyser.",
        "description": "Part of the Golden Circle, the Geysir area is a hotbed of geothermal activity. Strokkur geyser erupts every few minutes, shooting a column of water up to 20 meters high.",
        "imageUrl": "images/fjaorar.webp",
        "region": "Southern Iceland",
        "type": "Geothermal Area"
      },
      {
        "id": 12,
        "name": "Snæfellsjökull National Park",
        "shortDescription": "A national park centered around a stratovolcano glacier.",
        "description": "Snæfellsjökull is a magnificent glacier-capped volcano. The national park offers rugged landscapes, black sand beaches, and dramatic cliffs.",
        "imageUrl": "images/snaefell.webp",
        "region": "Western Iceland",
        "type": "National Park"
      },
      {
        "id": 13,
        "name": "Landmannalaugar",
        "shortDescription": "A remote and beautiful region known for its rhyolite mountains.",
        "description": "Located in the Highlands, Landmannalaugar is famous for its colorful mountains, hot springs, and hiking trails. It is a popular destination for adventurers.",
        "imageUrl": "images/landman.webp",
        "region": "Highlands",
        "type": "Hiking Area"
      },
      {
        "id": 14,
        "name": "Vestrahorn Mountain",
        "shortDescription": "A stunning mountain on the Stokksnes peninsula.",
        "description": "Vestrahorn is a majestic mountain range on the Stokksnes peninsula, famous for its dramatic, jagged peaks and the reflection it creates on the black sand beach below.",
        "imageUrl": "images/stokksnes.webp",
        "region": "Eastern Iceland",
        "type": "Mountain"
      },
      {
        "id": 15,
        "name": "Seljalandsfoss Waterfall",
        "shortDescription": "A unique waterfall you can walk behind.",
        "description": "Seljalandsfoss is a picturesque waterfall on the South Coast. A path allows visitors to walk behind the cascading water, offering a unique perspective and photo opportunity.",
        "imageUrl": "images/seljalw.webp",
        "region": "Southern Iceland",
        "type": "Waterfall"
      }
    ]
  }